package top.javaguo.core.resp.enums;

/**
 * 请求响应编码
 * 
 * @author javaGuo
 * @date 2018/03/06
 */
public enum RespMsgEnum {

	// 系统应答语
	/** 执行成功 */
	_0000000("0000000", "执行成功"),
	/** 执行失败 */
	_1111111("1111111", "执行失败"),
    /** 无令牌访问 */
    _2222222("2222222", "无令牌访问"),
    /** 无签名访问 */
    _3333333("3333333", "无签名访问"),
    /** 签名错误 */
    _4444444("4444444", "签名错误"),
    /** 签名失效 */
    _5555555("5555555", "签名失效"),
	/** 系统异常 */
	_9999999("9999999", "系统异常"),

	// 登录应答语
	/** 登录-成功 */
	_0000001("0000001", "登录-成功"),
	/** 登录-账号错误 */
	_0000002("0000002", "登录-账号错误"),
	/** 登录-密码错误 */
	_0000003("0000003", "登录-密码错误"),
	/** 登录-账号不能为空 */
	_0000009("0000009", "登录-账号不能为空"),
	/** 登录-密码不能为空 */
	_0000010("0000010", "登录-密码不能为空"),
	/** 没有权限 */
	_8888888("8888888", "没有权限"),

	// 验证令牌
	/** 令牌验证-成功 */
	_0000004("0000004", "令牌验证-成功"),
	/** token验证-失败 */
	_0000005("0000005", "令牌验证-失败（原因：当前用户不存在或未在线）"),

	// 注销用户
	/** 用户注销-成功 */
	_0000006("0000006", "用户注销-成功"),
	/** 用户注销--失败 */
	_0000007("0000007", "用户注销-失败（原因：当前用户不存在或未在线）"),

	/** 数据删除-失败 */
	_0000008("0000008", "数据删除-失败（原因：当前数据已被使用）"),

	/** 请求参数不符合要求 */
	_0000011("0000011", "请求参数不符合要求"),

	/** 系统维护中 */
	_0000012("0000012", "系统维护中"),

	/** 响应自定义 */
	_0000013("0000013", ""),

	;

	/** 响应码 **/
	private String code;

	/** 响应内容 **/
	private String msg;

	/** 构造函数（需要传入响应码和相应内容） **/
	RespMsgEnum(String code, String msg) {
		this.code = code;
		this.msg = msg;
	}

	/** 获取响应码 **/
	public String getCode() {
		return code;
	}

	/** 获取响应内容 **/
	public String getMsg() {
		return msg;
	}

}
